
> Can you try running terraform again with the `TF_LOG=DEBUG` environment variable set? I think there was some problem with output not being passed to terraform, but visible in stderr from the go-virtualbox command, and the `DEBUG` also should log the output from the provider directly.

`$ TF_LOG=DEBUG terraform apply -auto-approve
2021-08-06T12:31:46.544+0430 [DEBUG] Adding temp file log sink: /tmp/terraform-log210253398
2021-08-06T12:31:46.544+0430 [INFO]  Terraform version: 1.0.3
2021-08-06T12:31:46.544+0430 [INFO]  Go runtime version: go1.16.4
2021-08-06T12:31:46.544+0430 [INFO]  CLI args: []string{"/usr/bin/terraform", "apply", "-auto-approve"}
2021-08-06T12:31:46.544+0430 [DEBUG] Attempting to open CLI config file: /home/behrad/.terraformrc
2021-08-06T12:31:46.544+0430 [DEBUG] File doesn't exist, but doesn't need to. Ignoring.
2021-08-06T12:31:46.544+0430 [DEBUG] ignoring non-existing provider search directory terraform.d/plugins
2021-08-06T12:31:46.544+0430 [DEBUG] ignoring non-existing provider search directory /home/behrad/.terraform.d/plugins
2021-08-06T12:31:46.544+0430 [DEBUG] ignoring non-existing provider search directory /home/behrad/.local/share/terraform/plugins
2021-08-06T12:31:46.544+0430 [DEBUG] ignoring non-existing provider search directory /usr/share/i3/terraform/plugins
2021-08-06T12:31:46.544+0430 [DEBUG] ignoring non-existing provider search directory /usr/local/share/terraform/plugins
2021-08-06T12:31:46.544+0430 [DEBUG] ignoring non-existing provider search directory /usr/share/terraform/plugins
2021-08-06T12:31:46.544+0430 [DEBUG] ignoring non-existing provider search directory /var/lib/snapd/desktop/terraform/plugins
2021-08-06T12:31:46.544+0430 [INFO]  CLI command args: []string{"apply", "-auto-approve"}
2021-08-06T12:31:46.545+0430 [DEBUG] New state was assigned lineage "fa3be89d-a8fc-894d-b2b4-9c4d59ce5cc3"
2021-08-06T12:31:46.611+0430 [DEBUG] checking for provisioner in "."
2021-08-06T12:31:46.618+0430 [DEBUG] checking for provisioner in "/usr/bin"
2021-08-06T12:31:46.619+0430 [DEBUG] checking for provisioner in ".terraform/plugins/linux_amd64"
2021-08-06T12:31:46.619+0430 [INFO]  Failed to read plugin lock file .terraform/plugins/linux_amd64/lock.json: open .terraform/plugins/linux_amd64/lock.json: no such file or directory
2021-08-06T12:31:46.619+0430 [INFO]  backend/local: starting Apply operation
2021-08-06T12:31:46.620+0430 [DEBUG] created provider logger: level=debug
2021-08-06T12:31:46.620+0430 [INFO]  provider: configuring client automatic mTLS
2021-08-06T12:31:46.666+0430 [DEBUG] provider: starting plugin: path=.terraform/providers/registry.terraform.io/terra-farm/virtualbox/0.2.1-alpha.1/linux_amd64/terraform-provider-virtualbox_v0.2.1-alpha.1 args=[.terraform/providers/registry.terraform.io/terra-farm/virtualbox/0.2.1-alpha.1/linux_amd64/terraform-provider-virtualbox_v0.2.1-alpha.1]
2021-08-06T12:31:46.666+0430 [DEBUG] provider: plugin started: path=.terraform/providers/registry.terraform.io/terra-farm/virtualbox/0.2.1-alpha.1/linux_amd64/terraform-provider-virtualbox_v0.2.1-alpha.1 pid=179418
2021-08-06T12:31:46.666+0430 [DEBUG] provider: waiting for RPC address: path=.terraform/providers/registry.terraform.io/terra-farm/virtualbox/0.2.1-alpha.1/linux_amd64/terraform-provider-virtualbox_v0.2.1-alpha.1
2021-08-06T12:31:46.674+0430 [INFO]  provider.terraform-provider-virtualbox_v0.2.1-alpha.1: configuring server automatic mTLS: timestamp=2021-08-06T12:31:46.674+0430
2021-08-06T12:31:46.707+0430 [DEBUG] provider.terraform-provider-virtualbox_v0.2.1-alpha.1: plugin address: network=unix address=/tmp/plugin237494442 timestamp=2021-08-06T12:31:46.707+0430
2021-08-06T12:31:46.707+0430 [DEBUG] provider: using plugin: version=5
2021-08-06T12:31:46.768+0430 [DEBUG] No provider meta schema returned
2021-08-06T12:31:46.769+0430 [DEBUG] provider.stdio: received EOF, stopping recv loop: err="rpc error: code = Unavailable desc = transport is closing"
2021-08-06T12:31:46.770+0430 [DEBUG] provider: plugin process exited: path=.terraform/providers/registry.terraform.io/terra-farm/virtualbox/0.2.1-alpha.1/linux_amd64/terraform-provider-virtualbox_v0.2.1-alpha.1 pid=179418
2021-08-06T12:31:46.770+0430 [DEBUG] provider: plugin exited
2021-08-06T12:31:46.770+0430 [INFO]  terraform: building graph: GraphTypeValidate
2021-08-06T12:31:46.770+0430 [DEBUG] ProviderTransformer: "virtualbox_vm.node" (*terraform.NodeValidatableResource) needs provider["registry.terraform.io/terra-farm/virtualbox"]
2021-08-06T12:31:46.770+0430 [DEBUG] ReferenceTransformer: "virtualbox_vm.node" references: []
2021-08-06T12:31:46.770+0430 [DEBUG] ReferenceTransformer: "provider[\"registry.terraform.io/terra-farm/virtualbox\"]" references: []
2021-08-06T12:31:46.771+0430 [DEBUG] Starting graph walk: walkValidate
2021-08-06T12:31:46.771+0430 [DEBUG] created provider logger: level=debug
2021-08-06T12:31:46.771+0430 [INFO]  provider: configuring client automatic mTLS
2021-08-06T12:31:46.813+0430 [DEBUG] provider: starting plugin: path=.terraform/providers/registry.terraform.io/terra-farm/virtualbox/0.2.1-alpha.1/linux_amd64/terraform-provider-virtualbox_v0.2.1-alpha.1 args=[.terraform/providers/registry.terraform.io/terra-farm/virtualbox/0.2.1-alpha.1/linux_amd64/terraform-provider-virtualbox_v0.2.1-alpha.1]
2021-08-06T12:31:46.813+0430 [DEBUG] provider: plugin started: path=.terraform/providers/registry.terraform.io/terra-farm/virtualbox/0.2.1-alpha.1/linux_amd64/terraform-provider-virtualbox_v0.2.1-alpha.1 pid=179428
2021-08-06T12:31:46.814+0430 [DEBUG] provider: waiting for RPC address: path=.terraform/providers/registry.terraform.io/terra-farm/virtualbox/0.2.1-alpha.1/linux_amd64/terraform-provider-virtualbox_v0.2.1-alpha.1
2021-08-06T12:31:46.821+0430 [INFO]  provider.terraform-provider-virtualbox_v0.2.1-alpha.1: configuring server automatic mTLS: timestamp=2021-08-06T12:31:46.821+0430
2021-08-06T12:31:46.854+0430 [DEBUG] provider.terraform-provider-virtualbox_v0.2.1-alpha.1: plugin address: address=/tmp/plugin376302207 network=unix timestamp=2021-08-06T12:31:46.854+0430
2021-08-06T12:31:46.854+0430 [DEBUG] provider: using plugin: version=5
2021-08-06T12:31:46.913+0430 [DEBUG] No provider meta schema returned
2021-08-06T12:31:46.914+0430 [DEBUG] provider.stdio: received EOF, stopping recv loop: err="rpc error: code = Unavailable desc = transport is closing"
2021-08-06T12:31:46.915+0430 [DEBUG] provider: plugin process exited: path=.terraform/providers/registry.terraform.io/terra-farm/virtualbox/0.2.1-alpha.1/linux_amd64/terraform-provider-virtualbox_v0.2.1-alpha.1 pid=179428
2021-08-06T12:31:46.915+0430 [DEBUG] provider: plugin exited
2021-08-06T12:31:46.915+0430 [INFO]  backend/local: apply calling Plan
2021-08-06T12:31:46.915+0430 [INFO]  terraform: building graph: GraphTypePlan
2021-08-06T12:31:46.915+0430 [DEBUG] ProviderTransformer: "virtualbox_vm.node (expand)" (*terraform.nodeExpandPlannableResource) needs provider["registry.terraform.io/terra-farm/virtualbox"]
2021-08-06T12:31:46.915+0430 [DEBUG] ReferenceTransformer: "virtualbox_vm.node (expand)" references: []
2021-08-06T12:31:46.915+0430 [DEBUG] ReferenceTransformer: "provider[\"registry.terraform.io/terra-farm/virtualbox\"]" references: []
2021-08-06T12:31:46.916+0430 [DEBUG] Starting graph walk: walkPlan
2021-08-06T12:31:46.916+0430 [DEBUG] created provider logger: level=debug
2021-08-06T12:31:46.916+0430 [INFO]  provider: configuring client automatic mTLS
2021-08-06T12:31:46.957+0430 [DEBUG] provider: starting plugin: path=.terraform/providers/registry.terraform.io/terra-farm/virtualbox/0.2.1-alpha.1/linux_amd64/terraform-provider-virtualbox_v0.2.1-alpha.1 args=[.terraform/providers/registry.terraform.io/terra-farm/virtualbox/0.2.1-alpha.1/linux_amd64/terraform-provider-virtualbox_v0.2.1-alpha.1]
2021-08-06T12:31:46.958+0430 [DEBUG] provider: plugin started: path=.terraform/providers/registry.terraform.io/terra-farm/virtualbox/0.2.1-alpha.1/linux_amd64/terraform-provider-virtualbox_v0.2.1-alpha.1 pid=179437
2021-08-06T12:31:46.958+0430 [DEBUG] provider: waiting for RPC address: path=.terraform/providers/registry.terraform.io/terra-farm/virtualbox/0.2.1-alpha.1/linux_amd64/terraform-provider-virtualbox_v0.2.1-alpha.1
2021-08-06T12:31:46.966+0430 [INFO]  provider.terraform-provider-virtualbox_v0.2.1-alpha.1: configuring server automatic mTLS: timestamp=2021-08-06T12:31:46.966+0430
2021-08-06T12:31:46.999+0430 [DEBUG] provider.terraform-provider-virtualbox_v0.2.1-alpha.1: plugin address: address=/tmp/plugin458253246 network=unix timestamp=2021-08-06T12:31:46.998+0430
2021-08-06T12:31:46.999+0430 [DEBUG] provider: using plugin: version=5
2021-08-06T12:31:47.059+0430 [DEBUG] No provider meta schema returned
2021-08-06T12:31:47.060+0430 [DEBUG] Resource instance state not found for node "virtualbox_vm.node[0]", instance virtualbox_vm.node[0]
2021-08-06T12:31:47.060+0430 [DEBUG] ReferenceTransformer: "virtualbox_vm.node[0]" references: []
2021-08-06T12:31:47.060+0430 [DEBUG] refresh: virtualbox_vm.node[0]: no state, so not refreshing
2021-08-06T12:31:47.063+0430 [DEBUG] provider.stdio: received EOF, stopping recv loop: err="rpc error: code = Unavailable desc = transport is closing"
2021-08-06T12:31:47.064+0430 [DEBUG] provider: plugin process exited: path=.terraform/providers/registry.terraform.io/terra-farm/virtualbox/0.2.1-alpha.1/linux_amd64/terraform-provider-virtualbox_v0.2.1-alpha.1 pid=179437
2021-08-06T12:31:47.064+0430 [DEBUG] provider: plugin exited

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the
following symbols:
  + create

Terraform will perform the following actions:

  # virtualbox_vm.node[0] will be created
  + resource "virtualbox_vm" "node" {
      + cpus   = 2
      + id     = (known after apply)
      + image  = "/home/behrad/Behrad_Eslamifar/Projects/linuxmotto/Casio/desktop/terraform/virtualbox.box"
      + memory = "512 mib"
      + name   = "node-100"
      + status = "running"

      + network_adapter {
          + device                 = "IntelPro1000MTDesktop"
          + host_interface         = "wlp0s20f3"
          + ipv4_address           = (known after apply)
          + ipv4_address_available = (known after apply)
          + mac_address            = (known after apply)
          + status                 = (known after apply)
          + type                   = "bridge"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
2021-08-06T12:31:47.064+0430 [INFO]  backend/local: apply calling Apply
2021-08-06T12:31:47.064+0430 [INFO]  terraform: building graph: GraphTypeApply
2021-08-06T12:31:47.064+0430 [DEBUG] Resource state not found for node "virtualbox_vm.node[0]", instance virtualbox_vm.node[0]
2021-08-06T12:31:47.065+0430 [DEBUG] ProviderTransformer: "virtualbox_vm.node[0]" (*terraform.NodeApplyableResourceInstance) needs provider["registry.terraform.io/terra-farm/virtualbox"]
2021-08-06T12:31:47.065+0430 [DEBUG] ProviderTransformer: "virtualbox_vm.node (expand)" (*terraform.nodeExpandApplyableResource) needs provider["registry.terraform.io/terra-farm/virtualbox"]
2021-08-06T12:31:47.065+0430 [DEBUG] ReferenceTransformer: "virtualbox_vm.node (expand)" references: []
2021-08-06T12:31:47.065+0430 [DEBUG] ReferenceTransformer: "virtualbox_vm.node[0]" references: []
2021-08-06T12:31:47.065+0430 [DEBUG] ReferenceTransformer: "provider[\"registry.terraform.io/terra-farm/virtualbox\"]" references: []
2021-08-06T12:31:47.065+0430 [DEBUG] Starting graph walk: walkApply
2021-08-06T12:31:47.065+0430 [DEBUG] created provider logger: level=debug
2021-08-06T12:31:47.065+0430 [INFO]  provider: configuring client automatic mTLS
2021-08-06T12:31:47.106+0430 [DEBUG] provider: starting plugin: path=.terraform/providers/registry.terraform.io/terra-farm/virtualbox/0.2.1-alpha.1/linux_amd64/terraform-provider-virtualbox_v0.2.1-alpha.1 args=[.terraform/providers/registry.terraform.io/terra-farm/virtualbox/0.2.1-alpha.1/linux_amd64/terraform-provider-virtualbox_v0.2.1-alpha.1]
2021-08-06T12:31:47.106+0430 [DEBUG] provider: plugin started: path=.terraform/providers/registry.terraform.io/terra-farm/virtualbox/0.2.1-alpha.1/linux_amd64/terraform-provider-virtualbox_v0.2.1-alpha.1 pid=179446
2021-08-06T12:31:47.107+0430 [DEBUG] provider: waiting for RPC address: path=.terraform/providers/registry.terraform.io/terra-farm/virtualbox/0.2.1-alpha.1/linux_amd64/terraform-provider-virtualbox_v0.2.1-alpha.1
2021-08-06T12:31:47.115+0430 [INFO]  provider.terraform-provider-virtualbox_v0.2.1-alpha.1: configuring server automatic mTLS: timestamp=2021-08-06T12:31:47.114+0430
2021-08-06T12:31:47.147+0430 [DEBUG] provider.terraform-provider-virtualbox_v0.2.1-alpha.1: plugin address: address=/tmp/plugin304364723 network=unix timestamp=2021-08-06T12:31:47.147+0430
2021-08-06T12:31:47.148+0430 [DEBUG] provider: using plugin: version=5
2021-08-06T12:31:47.209+0430 [DEBUG] No provider meta schema returned
virtualbox_vm.node[0]: Creating...
2021-08-06T12:31:47.212+0430 [INFO]  Starting apply for virtualbox_vm.node[0]
2021-08-06T12:31:47.212+0430 [DEBUG] virtualbox_vm.node[0]: applying the planned Create change
2021-08-06T12:31:48.290+0430 [DEBUG] provider.terraform-provider-virtualbox_v0.2.1-alpha.1: pid-179446-utils.go:12: [ERROR] Create virtualbox VM node-100: machine already exists
2021-08-06T12:31:48.290+0430 [DEBUG] provider.terraform-provider-virtualbox_v0.2.1-alpha.1: 
╷
│ Error: [ERROR] Create virtualbox VM node-100: machine already exists
│ 
│ 
│   with virtualbox_vm.node[0],
│   on main-vbox.tf line 10, in resource "virtualbox_vm" "node":
│   10: resource "virtualbox_vm" "node" {
│ 
╵
2021-08-06T12:31:48.306+0430 [DEBUG] provider.stdio: received EOF, stopping recv loop: err="rpc error: code = Unavailable desc = transport is closing"
2021-08-06T12:31:48.310+0430 [DEBUG] provider: plugin process exited: path=.terraform/providers/registry.terraform.io/terra-farm/virtualbox/0.2.1-alpha.1/linux_amd64/terraform-provider-virtualbox_v0.2.1-alpha.1 pid=179446
2021-08-06T12:31:48.310+0430 [DEBUG] provider: plugin exited`